InformationRegisters/ЛицензииПоставщиковАлкогольнойПродукции/ЛицензииПоставщиковАлкогольнойПродукции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЛицензииПоставщиковАлкогольнойПродукции</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>СерияНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КемВыдана</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВидДеятельности</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КодВидаПродукции</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидЛицензии</name>
    <type>
      <types>EnumRef.ВидыЛицензийНаПродажуАлкоголя</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

InformationRegisters/ЛицензииПоставщиковАлкогольнойПродукции/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Обработчик обновления.
//
Процедура ЗаполнитьВидыДеятельности() Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	*
	|ИЗ
	|	РегистрСведений.ЛицензииПоставщиковАлкогольнойПродукции КАК ЛицензииПоставщиковАлкогольнойПродукции
	|ГДЕ
	|	ЛицензииПоставщиковАлкогольнойПродукции.ВидДеятельности = """"");
	Выборка = Запрос.Выполнить().Выбрать();
	
	Лицензии = РегистрыСведений.ЛицензииПоставщиковАлкогольнойПродукции.СоздатьНаборЗаписей();
	Отбор = Лицензии.Отбор;
	Пока Выборка.Следующий() Цикл
		
		Отбор.Период.Установить(Выборка.Период);
		Отбор.Поставщик.Установить(Выборка.Поставщик);
		Отбор.КодВидаПродукции.Установить(Выборка.КодВидаПродукции);
		Отбор.ВидЛицензии.Установить(Выборка.ВидЛицензии);
		
		Лицензия = Лицензии.Добавить();
		ЗаполнитьЗначенияСвойств(Лицензия, Выборка, , "ВидДеятельности");
		Лицензия.ВидДеятельности = ?(ПустаяСтрока(Выборка.КодВидаПродукции),
			НСтр("ru = 'Закупка, хранение и поставки алкогольной и спиртосодержащей продукции'"),
			НСтр("ru = 'Производство, хранение и поставки произведенной алкогольной и спиртосодержащей пищевой продукции'"));
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(Лицензии);
		
		Лицензии.Очистить();
		
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
